name: "BN-Inception"
layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "/home/peiyong/Data/ucf101/listUtils/ucf_ims/train_split1.txt"
    batch_size: 16
    new_length: 1
    num_segments: 3
    modality: RGB
    shuffle: true
    name_pattern: "frame%04d.jpg"
  }
  transform_param{
    crop_size: 224
    mirror: true
    fix_crop: true
    more_fix_crop: true
    multi_scale: true
    max_distort: 1
    scale_ratios:[1,.875,.75, .66]
    is_flow: false
    mean_value: [104, 117, 123, 104, 117, 123,104, 117, 123]
  }
  include: { phase: TRAIN }
}
layer {
  name: "data"
  type: "VideoData"
  top: "data"
  top: "label"
  video_data_param {
    source: "/home/peiyong/Data/ucf101/listUtils/ucf_ims/valid_split1.txt"
    batch_size: 16
    new_length: 1
    num_segments: 3
    modality: RGB
    name_pattern: "frame%04d.jpg"
  }
  transform_param{
    crop_size: 224
    mirror: false
    mean_value: [104, 117, 123, 104, 117, 123,104, 117, 123]
  }
  include: { phase: TEST }
}
layer { name: "reshape_data" type: "Reshape" bottom: "data" top: "reshape_data" reshape_param { shape { dim: -1 dim: 3 dim: 224 dim: 224 } } }
layer {name: "ECOC_label" type:"Python" bottom:"label" top:"ECOC_label" python_param {module:'ECOC_v1' layer: 'ECOCLayer'
       param_str : "{\'num_Cls\':1000}"}}

layer {name:"Slice_ECOC" type:"Slice" bottom:"ECOC_label"  top:"ECOC0" top:"ECOC1" top:"ECOC2" top:"ECOC3" top:"ECOC4" top:"ECOC5" top:"ECOC6" top:"ECOC7" top:"ECOC8" top:"ECOC9" top:"ECOC10" top:"ECOC11" top:"ECOC12" top:"ECOC13" top:"ECOC14" top:"ECOC15" top:"ECOC16" top:"ECOC17" top:"ECOC18" top:"ECOC19" top:"ECOC20" top:"ECOC21" top:"ECOC22" top:"ECOC23" top:"ECOC24" top:"ECOC25" top:"ECOC26" top:"ECOC27" top:"ECOC28" top:"ECOC29" top:"ECOC30" top:"ECOC31" top:"ECOC32" top:"ECOC33" top:"ECOC34" top:"ECOC35" top:"ECOC36" top:"ECOC37" top:"ECOC38" top:"ECOC39" top:"ECOC40" top:"ECOC41" top:"ECOC42" top:"ECOC43" top:"ECOC44" top:"ECOC45" top:"ECOC46" top:"ECOC47" top:"ECOC48" top:"ECOC49" top:"ECOC50" top:"ECOC51" top:"ECOC52" top:"ECOC53" top:"ECOC54" top:"ECOC55" top:"ECOC56" top:"ECOC57" top:"ECOC58" top:"ECOC59" top:"ECOC60" top:"ECOC61" top:"ECOC62" top:"ECOC63" top:"ECOC64" top:"ECOC65" top:"ECOC66" top:"ECOC67" top:"ECOC68" top:"ECOC69" top:"ECOC70" top:"ECOC71" top:"ECOC72" top:"ECOC73" top:"ECOC74" top:"ECOC75" top:"ECOC76" top:"ECOC77" top:"ECOC78" top:"ECOC79" top:"ECOC80" top:"ECOC81" top:"ECOC82" top:"ECOC83" top:"ECOC84" top:"ECOC85" top:"ECOC86" top:"ECOC87" top:"ECOC88" top:"ECOC89" top:"ECOC90" top:"ECOC91" top:"ECOC92" top:"ECOC93" top:"ECOC94" top:"ECOC95" top:"ECOC96" top:"ECOC97" top:"ECOC98" top:"ECOC99" top:"ECOC100" top:"ECOC101" top:"ECOC102" top:"ECOC103" top:"ECOC104" top:"ECOC105" top:"ECOC106" top:"ECOC107" top:"ECOC108" top:"ECOC109" top:"ECOC110" top:"ECOC111" top:"ECOC112" top:"ECOC113" top:"ECOC114" top:"ECOC115" top:"ECOC116" top:"ECOC117" top:"ECOC118" top:"ECOC119" top:"ECOC120" top:"ECOC121" top:"ECOC122" top:"ECOC123" top:"ECOC124" top:"ECOC125" top:"ECOC126" top:"ECOC127" top:"ECOC128" top:"ECOC129" top:"ECOC130" top:"ECOC131" top:"ECOC132" top:"ECOC133" top:"ECOC134" top:"ECOC135" top:"ECOC136" top:"ECOC137" top:"ECOC138" top:"ECOC139" top:"ECOC140" top:"ECOC141" top:"ECOC142" top:"ECOC143" top:"ECOC144" top:"ECOC145" top:"ECOC146" top:"ECOC147" top:"ECOC148" top:"ECOC149" top:"ECOC150" top:"ECOC151" top:"ECOC152" top:"ECOC153" top:"ECOC154" top:"ECOC155" top:"ECOC156" top:"ECOC157" top:"ECOC158" top:"ECOC159" top:"ECOC160" top:"ECOC161" top:"ECOC162" top:"ECOC163" top:"ECOC164" top:"ECOC165" top:"ECOC166" top:"ECOC167" top:"ECOC168" top:"ECOC169" top:"ECOC170" top:"ECOC171" top:"ECOC172" top:"ECOC173" top:"ECOC174" top:"ECOC175" top:"ECOC176" top:"ECOC177" top:"ECOC178" top:"ECOC179" top:"ECOC180" top:"ECOC181" top:"ECOC182" top:"ECOC183" top:"ECOC184" top:"ECOC185" top:"ECOC186" top:"ECOC187" top:"ECOC188" top:"ECOC189" top:"ECOC190" top:"ECOC191" top:"ECOC192" top:"ECOC193" top:"ECOC194" top:"ECOC195" top:"ECOC196" top:"ECOC197" top:"ECOC198" top:"ECOC199" top:"ECOC200" top:"ECOC201" top:"ECOC202" top:"ECOC203" top:"ECOC204" top:"ECOC205" top:"ECOC206" top:"ECOC207" top:"ECOC208" top:"ECOC209" top:"ECOC210" top:"ECOC211" top:"ECOC212" top:"ECOC213" top:"ECOC214" top:"ECOC215" top:"ECOC216" top:"ECOC217" top:"ECOC218" top:"ECOC219" top:"ECOC220" top:"ECOC221" top:"ECOC222" top:"ECOC223" top:"ECOC224" top:"ECOC225" top:"ECOC226" top:"ECOC227" top:"ECOC228" top:"ECOC229" top:"ECOC230" top:"ECOC231" top:"ECOC232" top:"ECOC233" top:"ECOC234" top:"ECOC235" top:"ECOC236" top:"ECOC237" top:"ECOC238" top:"ECOC239" top:"ECOC240" top:"ECOC241" top:"ECOC242" top:"ECOC243" top:"ECOC244" top:"ECOC245" top:"ECOC246" top:"ECOC247" top:"ECOC248" top:"ECOC249" top:"ECOC250" top:"ECOC251" top:"ECOC252" top:"ECOC253" top:"ECOC254" top:"ECOC255" top:"ECOC256" top:"ECOC257" top:"ECOC258" top:"ECOC259" top:"ECOC260" top:"ECOC261" top:"ECOC262" top:"ECOC263" top:"ECOC264" top:"ECOC265" top:"ECOC266" top:"ECOC267" top:"ECOC268" top:"ECOC269" top:"ECOC270" top:"ECOC271" top:"ECOC272" top:"ECOC273" top:"ECOC274" top:"ECOC275" top:"ECOC276" top:"ECOC277" top:"ECOC278" top:"ECOC279" top:"ECOC280" top:"ECOC281" top:"ECOC282" top:"ECOC283" top:"ECOC284" top:"ECOC285" top:"ECOC286" top:"ECOC287" top:"ECOC288" top:"ECOC289" top:"ECOC290" top:"ECOC291" top:"ECOC292" top:"ECOC293" top:"ECOC294" top:"ECOC295" top:"ECOC296" top:"ECOC297" top:"ECOC298" top:"ECOC299" top:"ECOC300" top:"ECOC301" top:"ECOC302" top:"ECOC303" top:"ECOC304" top:"ECOC305" top:"ECOC306" top:"ECOC307" top:"ECOC308" top:"ECOC309" top:"ECOC310" top:"ECOC311" top:"ECOC312" top:"ECOC313" top:"ECOC314" top:"ECOC315" top:"ECOC316" top:"ECOC317" top:"ECOC318" top:"ECOC319" top:"ECOC320" top:"ECOC321" top:"ECOC322" top:"ECOC323" top:"ECOC324" top:"ECOC325" top:"ECOC326" top:"ECOC327" top:"ECOC328" top:"ECOC329" top:"ECOC330" top:"ECOC331" top:"ECOC332" top:"ECOC333" top:"ECOC334" top:"ECOC335" top:"ECOC336" top:"ECOC337" top:"ECOC338" top:"ECOC339" top:"ECOC340" top:"ECOC341" top:"ECOC342" top:"ECOC343" top:"ECOC344" top:"ECOC345" top:"ECOC346" top:"ECOC347" top:"ECOC348" top:"ECOC349" top:"ECOC350" top:"ECOC351" top:"ECOC352" top:"ECOC353" top:"ECOC354" top:"ECOC355" top:"ECOC356" top:"ECOC357" top:"ECOC358" top:"ECOC359" top:"ECOC360" top:"ECOC361" top:"ECOC362" top:"ECOC363" top:"ECOC364" top:"ECOC365" top:"ECOC366" top:"ECOC367" top:"ECOC368" top:"ECOC369" top:"ECOC370" top:"ECOC371" top:"ECOC372" top:"ECOC373" top:"ECOC374" top:"ECOC375" top:"ECOC376" top:"ECOC377" top:"ECOC378" top:"ECOC379" top:"ECOC380" top:"ECOC381" top:"ECOC382" top:"ECOC383" top:"ECOC384" top:"ECOC385" top:"ECOC386" top:"ECOC387" top:"ECOC388" top:"ECOC389" top:"ECOC390" top:"ECOC391" top:"ECOC392" top:"ECOC393" top:"ECOC394" top:"ECOC395" top:"ECOC396" top:"ECOC397" top:"ECOC398" top:"ECOC399" top:"ECOC400" top:"ECOC401" top:"ECOC402" top:"ECOC403" top:"ECOC404" top:"ECOC405" top:"ECOC406" top:"ECOC407" top:"ECOC408" top:"ECOC409" top:"ECOC410" top:"ECOC411" top:"ECOC412" top:"ECOC413" top:"ECOC414" top:"ECOC415" top:"ECOC416" top:"ECOC417" top:"ECOC418" top:"ECOC419" top:"ECOC420" top:"ECOC421" top:"ECOC422" top:"ECOC423" top:"ECOC424" top:"ECOC425" top:"ECOC426" top:"ECOC427" top:"ECOC428" top:"ECOC429" top:"ECOC430" top:"ECOC431" top:"ECOC432" top:"ECOC433" top:"ECOC434" top:"ECOC435" top:"ECOC436" top:"ECOC437" top:"ECOC438" top:"ECOC439" top:"ECOC440" top:"ECOC441" top:"ECOC442" top:"ECOC443" top:"ECOC444" top:"ECOC445" top:"ECOC446" top:"ECOC447" top:"ECOC448" top:"ECOC449" top:"ECOC450" top:"ECOC451" top:"ECOC452" top:"ECOC453" top:"ECOC454" top:"ECOC455" top:"ECOC456" top:"ECOC457" top:"ECOC458" top:"ECOC459" top:"ECOC460" top:"ECOC461" top:"ECOC462" top:"ECOC463" top:"ECOC464" top:"ECOC465" top:"ECOC466" top:"ECOC467" top:"ECOC468" top:"ECOC469" top:"ECOC470" top:"ECOC471" top:"ECOC472" top:"ECOC473" top:"ECOC474" top:"ECOC475" top:"ECOC476" top:"ECOC477" top:"ECOC478" top:"ECOC479" top:"ECOC480" top:"ECOC481" top:"ECOC482" top:"ECOC483" top:"ECOC484" top:"ECOC485" top:"ECOC486" top:"ECOC487" top:"ECOC488" top:"ECOC489" top:"ECOC490" top:"ECOC491" top:"ECOC492" top:"ECOC493" top:"ECOC494" top:"ECOC495" top:"ECOC496" top:"ECOC497" top:"ECOC498" top:"ECOC499" top:"ECOC500" top:"ECOC501" top:"ECOC502" top:"ECOC503" top:"ECOC504" top:"ECOC505" top:"ECOC506" top:"ECOC507" top:"ECOC508" top:"ECOC509" top:"ECOC510" top:"ECOC511" top:"ECOC512" top:"ECOC513" top:"ECOC514" top:"ECOC515" top:"ECOC516" top:"ECOC517" top:"ECOC518" top:"ECOC519" top:"ECOC520" top:"ECOC521" top:"ECOC522" top:"ECOC523" top:"ECOC524" top:"ECOC525" top:"ECOC526" top:"ECOC527" top:"ECOC528" top:"ECOC529" top:"ECOC530" top:"ECOC531" top:"ECOC532" top:"ECOC533" top:"ECOC534" top:"ECOC535" top:"ECOC536" top:"ECOC537" top:"ECOC538" top:"ECOC539" top:"ECOC540" top:"ECOC541" top:"ECOC542" top:"ECOC543" top:"ECOC544" top:"ECOC545" top:"ECOC546" top:"ECOC547" top:"ECOC548" top:"ECOC549" top:"ECOC550" top:"ECOC551" top:"ECOC552" top:"ECOC553" top:"ECOC554" top:"ECOC555" top:"ECOC556" top:"ECOC557" top:"ECOC558" top:"ECOC559" top:"ECOC560" top:"ECOC561" top:"ECOC562" top:"ECOC563" top:"ECOC564" top:"ECOC565" top:"ECOC566" top:"ECOC567" top:"ECOC568" top:"ECOC569" top:"ECOC570" top:"ECOC571" top:"ECOC572" top:"ECOC573" top:"ECOC574" top:"ECOC575" top:"ECOC576" top:"ECOC577" top:"ECOC578" top:"ECOC579" top:"ECOC580" top:"ECOC581" top:"ECOC582" top:"ECOC583" top:"ECOC584" top:"ECOC585" top:"ECOC586" top:"ECOC587" top:"ECOC588" top:"ECOC589" top:"ECOC590" top:"ECOC591" top:"ECOC592" top:"ECOC593" top:"ECOC594" top:"ECOC595" top:"ECOC596" top:"ECOC597" top:"ECOC598" top:"ECOC599" top:"ECOC600" top:"ECOC601" top:"ECOC602" top:"ECOC603" top:"ECOC604" top:"ECOC605" top:"ECOC606" top:"ECOC607" top:"ECOC608" top:"ECOC609" top:"ECOC610" top:"ECOC611" top:"ECOC612" top:"ECOC613" top:"ECOC614" top:"ECOC615" top:"ECOC616" top:"ECOC617" top:"ECOC618" top:"ECOC619" top:"ECOC620" top:"ECOC621" top:"ECOC622" top:"ECOC623" top:"ECOC624" top:"ECOC625" top:"ECOC626" top:"ECOC627" top:"ECOC628" top:"ECOC629" top:"ECOC630" top:"ECOC631" top:"ECOC632" top:"ECOC633" top:"ECOC634" top:"ECOC635" top:"ECOC636" top:"ECOC637" top:"ECOC638" top:"ECOC639" top:"ECOC640" top:"ECOC641" top:"ECOC642" top:"ECOC643" top:"ECOC644" top:"ECOC645" top:"ECOC646" top:"ECOC647" top:"ECOC648" top:"ECOC649" top:"ECOC650" top:"ECOC651" top:"ECOC652" top:"ECOC653" top:"ECOC654" top:"ECOC655" top:"ECOC656" top:"ECOC657" top:"ECOC658" top:"ECOC659" top:"ECOC660" top:"ECOC661" top:"ECOC662" top:"ECOC663" top:"ECOC664" top:"ECOC665" top:"ECOC666" top:"ECOC667" top:"ECOC668" top:"ECOC669" top:"ECOC670" top:"ECOC671" top:"ECOC672" top:"ECOC673" top:"ECOC674" top:"ECOC675" top:"ECOC676" top:"ECOC677" top:"ECOC678" top:"ECOC679" top:"ECOC680" top:"ECOC681" top:"ECOC682" top:"ECOC683" top:"ECOC684" top:"ECOC685" top:"ECOC686" top:"ECOC687" top:"ECOC688" top:"ECOC689" top:"ECOC690" top:"ECOC691" top:"ECOC692" top:"ECOC693" top:"ECOC694" top:"ECOC695" top:"ECOC696" top:"ECOC697" top:"ECOC698" top:"ECOC699" top:"ECOC700" top:"ECOC701" top:"ECOC702" top:"ECOC703" top:"ECOC704" top:"ECOC705" top:"ECOC706" top:"ECOC707" top:"ECOC708" top:"ECOC709" top:"ECOC710" top:"ECOC711" top:"ECOC712" top:"ECOC713" top:"ECOC714" top:"ECOC715" top:"ECOC716" top:"ECOC717" top:"ECOC718" top:"ECOC719" top:"ECOC720" top:"ECOC721" top:"ECOC722" top:"ECOC723" top:"ECOC724" top:"ECOC725" top:"ECOC726" top:"ECOC727" top:"ECOC728" top:"ECOC729" top:"ECOC730" top:"ECOC731" top:"ECOC732" top:"ECOC733" top:"ECOC734" top:"ECOC735" top:"ECOC736" top:"ECOC737" top:"ECOC738" top:"ECOC739" top:"ECOC740" top:"ECOC741" top:"ECOC742" top:"ECOC743" top:"ECOC744" top:"ECOC745" top:"ECOC746" top:"ECOC747" top:"ECOC748" top:"ECOC749" top:"ECOC750" top:"ECOC751" top:"ECOC752" top:"ECOC753" top:"ECOC754" top:"ECOC755" top:"ECOC756" top:"ECOC757" top:"ECOC758" top:"ECOC759" top:"ECOC760" top:"ECOC761" top:"ECOC762" top:"ECOC763" top:"ECOC764" top:"ECOC765" top:"ECOC766" top:"ECOC767" top:"ECOC768" top:"ECOC769" top:"ECOC770" top:"ECOC771" top:"ECOC772" top:"ECOC773" top:"ECOC774" top:"ECOC775" top:"ECOC776" top:"ECOC777" top:"ECOC778" top:"ECOC779" top:"ECOC780" top:"ECOC781" top:"ECOC782" top:"ECOC783" top:"ECOC784" top:"ECOC785" top:"ECOC786" top:"ECOC787" top:"ECOC788" top:"ECOC789" top:"ECOC790" top:"ECOC791" top:"ECOC792" top:"ECOC793" top:"ECOC794" top:"ECOC795" top:"ECOC796" top:"ECOC797" top:"ECOC798" top:"ECOC799" top:"ECOC800" top:"ECOC801" top:"ECOC802" top:"ECOC803" top:"ECOC804" top:"ECOC805" top:"ECOC806" top:"ECOC807" top:"ECOC808" top:"ECOC809" top:"ECOC810" top:"ECOC811" top:"ECOC812" top:"ECOC813" top:"ECOC814" top:"ECOC815" top:"ECOC816" top:"ECOC817" top:"ECOC818" top:"ECOC819" top:"ECOC820" top:"ECOC821" top:"ECOC822" top:"ECOC823" top:"ECOC824" top:"ECOC825" top:"ECOC826" top:"ECOC827" top:"ECOC828" top:"ECOC829" top:"ECOC830" top:"ECOC831" top:"ECOC832" top:"ECOC833" top:"ECOC834" top:"ECOC835" top:"ECOC836" top:"ECOC837" top:"ECOC838" top:"ECOC839" top:"ECOC840" top:"ECOC841" top:"ECOC842" top:"ECOC843" top:"ECOC844" top:"ECOC845" top:"ECOC846" top:"ECOC847" top:"ECOC848" top:"ECOC849" top:"ECOC850" top:"ECOC851" top:"ECOC852" top:"ECOC853" top:"ECOC854" top:"ECOC855" top:"ECOC856" top:"ECOC857" top:"ECOC858" top:"ECOC859" top:"ECOC860" top:"ECOC861" top:"ECOC862" top:"ECOC863" top:"ECOC864" top:"ECOC865" top:"ECOC866" top:"ECOC867" top:"ECOC868" top:"ECOC869" top:"ECOC870" top:"ECOC871" top:"ECOC872" top:"ECOC873" top:"ECOC874" top:"ECOC875" top:"ECOC876" top:"ECOC877" top:"ECOC878" top:"ECOC879" top:"ECOC880" top:"ECOC881" top:"ECOC882" top:"ECOC883" top:"ECOC884" top:"ECOC885" top:"ECOC886" top:"ECOC887" top:"ECOC888" top:"ECOC889" top:"ECOC890" top:"ECOC891" top:"ECOC892" top:"ECOC893" top:"ECOC894" top:"ECOC895" top:"ECOC896" top:"ECOC897" top:"ECOC898" top:"ECOC899" top:"ECOC900" top:"ECOC901" top:"ECOC902" top:"ECOC903" top:"ECOC904" top:"ECOC905" top:"ECOC906" top:"ECOC907" top:"ECOC908" top:"ECOC909" top:"ECOC910" top:"ECOC911" top:"ECOC912" top:"ECOC913" top:"ECOC914" top:"ECOC915" top:"ECOC916" top:"ECOC917" top:"ECOC918" top:"ECOC919" top:"ECOC920" top:"ECOC921" top:"ECOC922" top:"ECOC923" top:"ECOC924" top:"ECOC925" top:"ECOC926" top:"ECOC927" top:"ECOC928" top:"ECOC929" top:"ECOC930" top:"ECOC931" top:"ECOC932" top:"ECOC933" top:"ECOC934" top:"ECOC935" top:"ECOC936" top:"ECOC937" top:"ECOC938" top:"ECOC939" top:"ECOC940" top:"ECOC941" top:"ECOC942" top:"ECOC943" top:"ECOC944" top:"ECOC945" top:"ECOC946" top:"ECOC947" top:"ECOC948" top:"ECOC949" top:"ECOC950" top:"ECOC951" top:"ECOC952" top:"ECOC953" top:"ECOC954" top:"ECOC955" top:"ECOC956" top:"ECOC957" top:"ECOC958" top:"ECOC959" top:"ECOC960" top:"ECOC961" top:"ECOC962" top:"ECOC963" top:"ECOC964" top:"ECOC965" top:"ECOC966" top:"ECOC967" top:"ECOC968" top:"ECOC969" top:"ECOC970" top:"ECOC971" top:"ECOC972" top:"ECOC973" top:"ECOC974" top:"ECOC975" top:"ECOC976" top:"ECOC977" top:"ECOC978" top:"ECOC979" top:"ECOC980" top:"ECOC981" top:"ECOC982" top:"ECOC983" top:"ECOC984" top:"ECOC985" top:"ECOC986" top:"ECOC987" top:"ECOC988" top:"ECOC989" top:"ECOC990" top:"ECOC991" top:"ECOC992" top:"ECOC993" top:"ECOC994" top:"ECOC995" top:"ECOC996" top:"ECOC997" top:"ECOC998" top:"ECOC999"
     slice_param {axis:1 slice_point:1 slice_point:2 slice_point:3 slice_point:4 slice_point:5 slice_point:6 slice_point:7 slice_point:8 slice_point:9 slice_point:10 slice_point:11 slice_point:12 slice_point:13 slice_point:14 slice_point:15 slice_point:16 slice_point:17 slice_point:18 slice_point:19 slice_point:20 slice_point:21 slice_point:22 slice_point:23 slice_point:24 slice_point:25 slice_point:26 slice_point:27 slice_point:28 slice_point:29 slice_point:30 slice_point:31 slice_point:32 slice_point:33 slice_point:34 slice_point:35 slice_point:36 slice_point:37 slice_point:38 slice_point:39 slice_point:40 slice_point:41 slice_point:42 slice_point:43 slice_point:44 slice_point:45 slice_point:46 slice_point:47 slice_point:48 slice_point:49 slice_point:50 slice_point:51 slice_point:52 slice_point:53 slice_point:54 slice_point:55 slice_point:56 slice_point:57 slice_point:58 slice_point:59 slice_point:60 slice_point:61 slice_point:62 slice_point:63 slice_point:64 slice_point:65 slice_point:66 slice_point:67 slice_point:68 slice_point:69 slice_point:70 slice_point:71 slice_point:72 slice_point:73 slice_point:74 slice_point:75 slice_point:76 slice_point:77 slice_point:78 slice_point:79 slice_point:80 slice_point:81 slice_point:82 slice_point:83 slice_point:84 slice_point:85 slice_point:86 slice_point:87 slice_point:88 slice_point:89 slice_point:90 slice_point:91 slice_point:92 slice_point:93 slice_point:94 slice_point:95 slice_point:96 slice_point:97 slice_point:98 slice_point:99 slice_point:100 slice_point:101 slice_point:102 slice_point:103 slice_point:104 slice_point:105 slice_point:106 slice_point:107 slice_point:108 slice_point:109 slice_point:110 slice_point:111 slice_point:112 slice_point:113 slice_point:114 slice_point:115 slice_point:116 slice_point:117 slice_point:118 slice_point:119 slice_point:120 slice_point:121 slice_point:122 slice_point:123 slice_point:124 slice_point:125 slice_point:126 slice_point:127 slice_point:128 slice_point:129 slice_point:130 slice_point:131 slice_point:132 slice_point:133 slice_point:134 slice_point:135 slice_point:136 slice_point:137 slice_point:138 slice_point:139 slice_point:140 slice_point:141 slice_point:142 slice_point:143 slice_point:144 slice_point:145 slice_point:146 slice_point:147 slice_point:148 slice_point:149 slice_point:150 slice_point:151 slice_point:152 slice_point:153 slice_point:154 slice_point:155 slice_point:156 slice_point:157 slice_point:158 slice_point:159 slice_point:160 slice_point:161 slice_point:162 slice_point:163 slice_point:164 slice_point:165 slice_point:166 slice_point:167 slice_point:168 slice_point:169 slice_point:170 slice_point:171 slice_point:172 slice_point:173 slice_point:174 slice_point:175 slice_point:176 slice_point:177 slice_point:178 slice_point:179 slice_point:180 slice_point:181 slice_point:182 slice_point:183 slice_point:184 slice_point:185 slice_point:186 slice_point:187 slice_point:188 slice_point:189 slice_point:190 slice_point:191 slice_point:192 slice_point:193 slice_point:194 slice_point:195 slice_point:196 slice_point:197 slice_point:198 slice_point:199 slice_point:200 slice_point:201 slice_point:202 slice_point:203 slice_point:204 slice_point:205 slice_point:206 slice_point:207 slice_point:208 slice_point:209 slice_point:210 slice_point:211 slice_point:212 slice_point:213 slice_point:214 slice_point:215 slice_point:216 slice_point:217 slice_point:218 slice_point:219 slice_point:220 slice_point:221 slice_point:222 slice_point:223 slice_point:224 slice_point:225 slice_point:226 slice_point:227 slice_point:228 slice_point:229 slice_point:230 slice_point:231 slice_point:232 slice_point:233 slice_point:234 slice_point:235 slice_point:236 slice_point:237 slice_point:238 slice_point:239 slice_point:240 slice_point:241 slice_point:242 slice_point:243 slice_point:244 slice_point:245 slice_point:246 slice_point:247 slice_point:248 slice_point:249 slice_point:250 slice_point:251 slice_point:252 slice_point:253 slice_point:254 slice_point:255 slice_point:256 slice_point:257 slice_point:258 slice_point:259 slice_point:260 slice_point:261 slice_point:262 slice_point:263 slice_point:264 slice_point:265 slice_point:266 slice_point:267 slice_point:268 slice_point:269 slice_point:270 slice_point:271 slice_point:272 slice_point:273 slice_point:274 slice_point:275 slice_point:276 slice_point:277 slice_point:278 slice_point:279 slice_point:280 slice_point:281 slice_point:282 slice_point:283 slice_point:284 slice_point:285 slice_point:286 slice_point:287 slice_point:288 slice_point:289 slice_point:290 slice_point:291 slice_point:292 slice_point:293 slice_point:294 slice_point:295 slice_point:296 slice_point:297 slice_point:298 slice_point:299 slice_point:300 slice_point:301 slice_point:302 slice_point:303 slice_point:304 slice_point:305 slice_point:306 slice_point:307 slice_point:308 slice_point:309 slice_point:310 slice_point:311 slice_point:312 slice_point:313 slice_point:314 slice_point:315 slice_point:316 slice_point:317 slice_point:318 slice_point:319 slice_point:320 slice_point:321 slice_point:322 slice_point:323 slice_point:324 slice_point:325 slice_point:326 slice_point:327 slice_point:328 slice_point:329 slice_point:330 slice_point:331 slice_point:332 slice_point:333 slice_point:334 slice_point:335 slice_point:336 slice_point:337 slice_point:338 slice_point:339 slice_point:340 slice_point:341 slice_point:342 slice_point:343 slice_point:344 slice_point:345 slice_point:346 slice_point:347 slice_point:348 slice_point:349 slice_point:350 slice_point:351 slice_point:352 slice_point:353 slice_point:354 slice_point:355 slice_point:356 slice_point:357 slice_point:358 slice_point:359 slice_point:360 slice_point:361 slice_point:362 slice_point:363 slice_point:364 slice_point:365 slice_point:366 slice_point:367 slice_point:368 slice_point:369 slice_point:370 slice_point:371 slice_point:372 slice_point:373 slice_point:374 slice_point:375 slice_point:376 slice_point:377 slice_point:378 slice_point:379 slice_point:380 slice_point:381 slice_point:382 slice_point:383 slice_point:384 slice_point:385 slice_point:386 slice_point:387 slice_point:388 slice_point:389 slice_point:390 slice_point:391 slice_point:392 slice_point:393 slice_point:394 slice_point:395 slice_point:396 slice_point:397 slice_point:398 slice_point:399 slice_point:400 slice_point:401 slice_point:402 slice_point:403 slice_point:404 slice_point:405 slice_point:406 slice_point:407 slice_point:408 slice_point:409 slice_point:410 slice_point:411 slice_point:412 slice_point:413 slice_point:414 slice_point:415 slice_point:416 slice_point:417 slice_point:418 slice_point:419 slice_point:420 slice_point:421 slice_point:422 slice_point:423 slice_point:424 slice_point:425 slice_point:426 slice_point:427 slice_point:428 slice_point:429 slice_point:430 slice_point:431 slice_point:432 slice_point:433 slice_point:434 slice_point:435 slice_point:436 slice_point:437 slice_point:438 slice_point:439 slice_point:440 slice_point:441 slice_point:442 slice_point:443 slice_point:444 slice_point:445 slice_point:446 slice_point:447 slice_point:448 slice_point:449 slice_point:450 slice_point:451 slice_point:452 slice_point:453 slice_point:454 slice_point:455 slice_point:456 slice_point:457 slice_point:458 slice_point:459 slice_point:460 slice_point:461 slice_point:462 slice_point:463 slice_point:464 slice_point:465 slice_point:466 slice_point:467 slice_point:468 slice_point:469 slice_point:470 slice_point:471 slice_point:472 slice_point:473 slice_point:474 slice_point:475 slice_point:476 slice_point:477 slice_point:478 slice_point:479 slice_point:480 slice_point:481 slice_point:482 slice_point:483 slice_point:484 slice_point:485 slice_point:486 slice_point:487 slice_point:488 slice_point:489 slice_point:490 slice_point:491 slice_point:492 slice_point:493 slice_point:494 slice_point:495 slice_point:496 slice_point:497 slice_point:498 slice_point:499 slice_point:500 slice_point:501 slice_point:502 slice_point:503 slice_point:504 slice_point:505 slice_point:506 slice_point:507 slice_point:508 slice_point:509 slice_point:510 slice_point:511 slice_point:512 slice_point:513 slice_point:514 slice_point:515 slice_point:516 slice_point:517 slice_point:518 slice_point:519 slice_point:520 slice_point:521 slice_point:522 slice_point:523 slice_point:524 slice_point:525 slice_point:526 slice_point:527 slice_point:528 slice_point:529 slice_point:530 slice_point:531 slice_point:532 slice_point:533 slice_point:534 slice_point:535 slice_point:536 slice_point:537 slice_point:538 slice_point:539 slice_point:540 slice_point:541 slice_point:542 slice_point:543 slice_point:544 slice_point:545 slice_point:546 slice_point:547 slice_point:548 slice_point:549 slice_point:550 slice_point:551 slice_point:552 slice_point:553 slice_point:554 slice_point:555 slice_point:556 slice_point:557 slice_point:558 slice_point:559 slice_point:560 slice_point:561 slice_point:562 slice_point:563 slice_point:564 slice_point:565 slice_point:566 slice_point:567 slice_point:568 slice_point:569 slice_point:570 slice_point:571 slice_point:572 slice_point:573 slice_point:574 slice_point:575 slice_point:576 slice_point:577 slice_point:578 slice_point:579 slice_point:580 slice_point:581 slice_point:582 slice_point:583 slice_point:584 slice_point:585 slice_point:586 slice_point:587 slice_point:588 slice_point:589 slice_point:590 slice_point:591 slice_point:592 slice_point:593 slice_point:594 slice_point:595 slice_point:596 slice_point:597 slice_point:598 slice_point:599 slice_point:600 slice_point:601 slice_point:602 slice_point:603 slice_point:604 slice_point:605 slice_point:606 slice_point:607 slice_point:608 slice_point:609 slice_point:610 slice_point:611 slice_point:612 slice_point:613 slice_point:614 slice_point:615 slice_point:616 slice_point:617 slice_point:618 slice_point:619 slice_point:620 slice_point:621 slice_point:622 slice_point:623 slice_point:624 slice_point:625 slice_point:626 slice_point:627 slice_point:628 slice_point:629 slice_point:630 slice_point:631 slice_point:632 slice_point:633 slice_point:634 slice_point:635 slice_point:636 slice_point:637 slice_point:638 slice_point:639 slice_point:640 slice_point:641 slice_point:642 slice_point:643 slice_point:644 slice_point:645 slice_point:646 slice_point:647 slice_point:648 slice_point:649 slice_point:650 slice_point:651 slice_point:652 slice_point:653 slice_point:654 slice_point:655 slice_point:656 slice_point:657 slice_point:658 slice_point:659 slice_point:660 slice_point:661 slice_point:662 slice_point:663 slice_point:664 slice_point:665 slice_point:666 slice_point:667 slice_point:668 slice_point:669 slice_point:670 slice_point:671 slice_point:672 slice_point:673 slice_point:674 slice_point:675 slice_point:676 slice_point:677 slice_point:678 slice_point:679 slice_point:680 slice_point:681 slice_point:682 slice_point:683 slice_point:684 slice_point:685 slice_point:686 slice_point:687 slice_point:688 slice_point:689 slice_point:690 slice_point:691 slice_point:692 slice_point:693 slice_point:694 slice_point:695 slice_point:696 slice_point:697 slice_point:698 slice_point:699 slice_point:700 slice_point:701 slice_point:702 slice_point:703 slice_point:704 slice_point:705 slice_point:706 slice_point:707 slice_point:708 slice_point:709 slice_point:710 slice_point:711 slice_point:712 slice_point:713 slice_point:714 slice_point:715 slice_point:716 slice_point:717 slice_point:718 slice_point:719 slice_point:720 slice_point:721 slice_point:722 slice_point:723 slice_point:724 slice_point:725 slice_point:726 slice_point:727 slice_point:728 slice_point:729 slice_point:730 slice_point:731 slice_point:732 slice_point:733 slice_point:734 slice_point:735 slice_point:736 slice_point:737 slice_point:738 slice_point:739 slice_point:740 slice_point:741 slice_point:742 slice_point:743 slice_point:744 slice_point:745 slice_point:746 slice_point:747 slice_point:748 slice_point:749 slice_point:750 slice_point:751 slice_point:752 slice_point:753 slice_point:754 slice_point:755 slice_point:756 slice_point:757 slice_point:758 slice_point:759 slice_point:760 slice_point:761 slice_point:762 slice_point:763 slice_point:764 slice_point:765 slice_point:766 slice_point:767 slice_point:768 slice_point:769 slice_point:770 slice_point:771 slice_point:772 slice_point:773 slice_point:774 slice_point:775 slice_point:776 slice_point:777 slice_point:778 slice_point:779 slice_point:780 slice_point:781 slice_point:782 slice_point:783 slice_point:784 slice_point:785 slice_point:786 slice_point:787 slice_point:788 slice_point:789 slice_point:790 slice_point:791 slice_point:792 slice_point:793 slice_point:794 slice_point:795 slice_point:796 slice_point:797 slice_point:798 slice_point:799 slice_point:800 slice_point:801 slice_point:802 slice_point:803 slice_point:804 slice_point:805 slice_point:806 slice_point:807 slice_point:808 slice_point:809 slice_point:810 slice_point:811 slice_point:812 slice_point:813 slice_point:814 slice_point:815 slice_point:816 slice_point:817 slice_point:818 slice_point:819 slice_point:820 slice_point:821 slice_point:822 slice_point:823 slice_point:824 slice_point:825 slice_point:826 slice_point:827 slice_point:828 slice_point:829 slice_point:830 slice_point:831 slice_point:832 slice_point:833 slice_point:834 slice_point:835 slice_point:836 slice_point:837 slice_point:838 slice_point:839 slice_point:840 slice_point:841 slice_point:842 slice_point:843 slice_point:844 slice_point:845 slice_point:846 slice_point:847 slice_point:848 slice_point:849 slice_point:850 slice_point:851 slice_point:852 slice_point:853 slice_point:854 slice_point:855 slice_point:856 slice_point:857 slice_point:858 slice_point:859 slice_point:860 slice_point:861 slice_point:862 slice_point:863 slice_point:864 slice_point:865 slice_point:866 slice_point:867 slice_point:868 slice_point:869 slice_point:870 slice_point:871 slice_point:872 slice_point:873 slice_point:874 slice_point:875 slice_point:876 slice_point:877 slice_point:878 slice_point:879 slice_point:880 slice_point:881 slice_point:882 slice_point:883 slice_point:884 slice_point:885 slice_point:886 slice_point:887 slice_point:888 slice_point:889 slice_point:890 slice_point:891 slice_point:892 slice_point:893 slice_point:894 slice_point:895 slice_point:896 slice_point:897 slice_point:898 slice_point:899 slice_point:900 slice_point:901 slice_point:902 slice_point:903 slice_point:904 slice_point:905 slice_point:906 slice_point:907 slice_point:908 slice_point:909 slice_point:910 slice_point:911 slice_point:912 slice_point:913 slice_point:914 slice_point:915 slice_point:916 slice_point:917 slice_point:918 slice_point:919 slice_point:920 slice_point:921 slice_point:922 slice_point:923 slice_point:924 slice_point:925 slice_point:926 slice_point:927 slice_point:928 slice_point:929 slice_point:930 slice_point:931 slice_point:932 slice_point:933 slice_point:934 slice_point:935 slice_point:936 slice_point:937 slice_point:938 slice_point:939 slice_point:940 slice_point:941 slice_point:942 slice_point:943 slice_point:944 slice_point:945 slice_point:946 slice_point:947 slice_point:948 slice_point:949 slice_point:950 slice_point:951 slice_point:952 slice_point:953 slice_point:954 slice_point:955 slice_point:956 slice_point:957 slice_point:958 slice_point:959 slice_point:960 slice_point:961 slice_point:962 slice_point:963 slice_point:964 slice_point:965 slice_point:966 slice_point:967 slice_point:968 slice_point:969 slice_point:970 slice_point:971 slice_point:972 slice_point:973 slice_point:974 slice_point:975 slice_point:976 slice_point:977 slice_point:978 slice_point:979 slice_point:980 slice_point:981 slice_point:982 slice_point:983 slice_point:984 slice_point:985 slice_point:986 slice_point:987 slice_point:988 slice_point:989 slice_point:990 slice_point:991 slice_point:992 slice_point:993 slice_point:994 slice_point:995 slice_point:996 slice_point:997 slice_point:998 slice_point:999}}

#layer {name:"Slience" type:"Silence" bottom:"ECOC_label"}
####################################### conv1 #######################################
layer { name: "conv1/7x7_s2" type: "Convolution" bottom: "reshape_data" top: "conv1/7x7_s2"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 pad: 3 kernel_size: 7 stride: 2
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "conv1/7x7_s2_bn" type: "BN" bottom: "conv1/7x7_s2" top: "conv1/7x7_s2_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: false slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "conv1/relu_7x7" type: "ReLU" bottom: "conv1/7x7_s2_bn" top: "conv1/7x7_s2_bn" }
layer { name: "pool1/3x3_s2" type: "Pooling" bottom: "conv1/7x7_s2_bn" top: "pool1/3x3_s2"
  pooling_param { pool: MAX kernel_size: 3 stride: 2 } }

####################################### conv2 #######################################
layer { name: "conv2/3x3_reduce" type: "Convolution" bottom: "pool1/3x3_s2" top: "conv2/3x3_reduce"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "conv2/3x3_reduce_bn" type: "BN" bottom: "conv2/3x3_reduce" top: "conv2/3x3_reduce_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "conv2/relu_3x3_reduce" type: "ReLU" bottom: "conv2/3x3_reduce_bn" top: "conv2/3x3_reduce_bn" }
layer { name: "conv2/3x3" type: "Convolution" bottom: "conv2/3x3_reduce_bn" top: "conv2/3x3"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 192 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "conv2/3x3_bn" type: "BN" bottom: "conv2/3x3" top: "conv2/3x3_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "conv2/relu_3x3" type: "ReLU" bottom: "conv2/3x3_bn" top: "conv2/3x3_bn" }
layer { name: "pool2/3x3_s2" type: "Pooling" bottom: "conv2/3x3_bn" top: "pool2/3x3_s2"
  pooling_param { pool: MAX kernel_size: 3 stride: 2 } }

####################################### inception_3a #######################################
layer { name: "inception_3a/1x1" type: "Convolution" bottom: "pool2/3x3_s2" top: "inception_3a/1x1"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3a/1x1_bn" type: "BN" bottom: "inception_3a/1x1" top: "inception_3a/1x1_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3a/relu_1x1" type: "ReLU" bottom: "inception_3a/1x1_bn" top: "inception_3a/1x1_bn" }
layer { name: "inception_3a/3x3_reduce" type: "Convolution" bottom: "pool2/3x3_s2" top: "inception_3a/3x3_reduce"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3a/3x3_reduce_bn" type: "BN" bottom: "inception_3a/3x3_reduce" top: "inception_3a/3x3_reduce_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3a/relu_3x3_reduce" type: "ReLU" bottom: "inception_3a/3x3_reduce_bn" top: "inception_3a/3x3_reduce_bn" }
layer { name: "inception_3a/3x3" type: "Convolution" bottom: "inception_3a/3x3_reduce_bn" top: "inception_3a/3x3"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 pad: 1 kernel_size: 3
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3a/3x3_bn" type: "BN" bottom: "inception_3a/3x3" top: "inception_3a/3x3_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3a/relu_3x3" type: "ReLU" bottom: "inception_3a/3x3_bn" top: "inception_3a/3x3_bn" }
layer { name: "inception_3a/double_3x3_reduce" type: "Convolution" bottom: "pool2/3x3_s2" top: "inception_3a/double_3x3_reduce"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3a/double_3x3_reduce_bn" type: "BN" bottom: "inception_3a/double_3x3_reduce" top: "inception_3a/double_3x3_reduce_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3a/relu_double_3x3_reduce" type: "ReLU" bottom: "inception_3a/double_3x3_reduce_bn" top: "inception_3a/double_3x3_reduce_bn" }
layer { name: "inception_3a/double_3x3_1" type: "Convolution" bottom: "inception_3a/double_3x3_reduce_bn" top: "inception_3a/double_3x3_1"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3a/double_3x3_1_bn" type: "BN" bottom: "inception_3a/double_3x3_1" top: "inception_3a/double_3x3_1_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3a/relu_double_3x3_1" type: "ReLU" bottom: "inception_3a/double_3x3_1_bn" top: "inception_3a/double_3x3_1_bn" }
layer { name: "inception_3a/double_3x3_2" type: "Convolution" bottom: "inception_3a/double_3x3_1_bn" top: "inception_3a/double_3x3_2"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3a/double_3x3_2_bn" type: "BN" bottom: "inception_3a/double_3x3_2" top: "inception_3a/double_3x3_2_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3a/relu_double_3x3_2" type: "ReLU" bottom: "inception_3a/double_3x3_2_bn" top: "inception_3a/double_3x3_2_bn" }
layer { name: "inception_3a/pool" type: "Pooling" bottom: "pool2/3x3_s2" top: "inception_3a/pool"
  pooling_param { pool: AVE kernel_size: 3 stride: 1 pad: 1 } }
layer { name: "inception_3a/pool_proj" type: "Convolution" bottom: "inception_3a/pool" top: "inception_3a/pool_proj"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 32 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3a/pool_proj_bn" type: "BN" bottom: "inception_3a/pool_proj" top: "inception_3a/pool_proj_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3a/relu_pool_proj" type: "ReLU" bottom: "inception_3a/pool_proj_bn" top: "inception_3a/pool_proj_bn" }
layer { name: "inception_3a/output" type: "Concat"
  bottom: "inception_3a/1x1_bn"
  bottom: "inception_3a/3x3_bn"
  bottom: "inception_3a/double_3x3_2_bn"
  bottom: "inception_3a/pool_proj_bn"
  top: "inception_3a/output" }

####################################### inception_3b #######################################
layer { name: "inception_3b/1x1" type: "Convolution" bottom: "inception_3a/output" top: "inception_3b/1x1"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3b/1x1_bn" type: "BN" bottom: "inception_3b/1x1" top: "inception_3b/1x1_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3b/relu_1x1" type: "ReLU" bottom: "inception_3b/1x1_bn" top: "inception_3b/1x1_bn" }
layer { name: "inception_3b/3x3_reduce" type: "Convolution" bottom: "inception_3a/output" top: "inception_3b/3x3_reduce"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3b/3x3_reduce_bn" type: "BN" bottom: "inception_3b/3x3_reduce" top: "inception_3b/3x3_reduce_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3b/relu_3x3_reduce" type: "ReLU" bottom: "inception_3b/3x3_reduce_bn" top: "inception_3b/3x3_reduce_bn" }
layer { name: "inception_3b/3x3" type: "Convolution" bottom: "inception_3b/3x3_reduce_bn" top: "inception_3b/3x3"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3b/3x3_bn" type: "BN" bottom: "inception_3b/3x3" top: "inception_3b/3x3_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3b/relu_3x3" type: "ReLU" bottom: "inception_3b/3x3_bn" top: "inception_3b/3x3_bn" }
layer { name: "inception_3b/double_3x3_reduce" type: "Convolution" bottom: "inception_3a/output" top: "inception_3b/double_3x3_reduce"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3b/double_3x3_reduce_bn" type: "BN" bottom: "inception_3b/double_3x3_reduce" top: "inception_3b/double_3x3_reduce_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3b/relu_double_3x3_reduce" type: "ReLU" bottom: "inception_3b/double_3x3_reduce_bn" top: "inception_3b/double_3x3_reduce_bn" }
layer { name: "inception_3b/double_3x3_1" type: "Convolution" bottom: "inception_3b/double_3x3_reduce_bn" top: "inception_3b/double_3x3_1"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3b/double_3x3_1_bn" type: "BN" bottom: "inception_3b/double_3x3_1" top: "inception_3b/double_3x3_1_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3b/relu_double_3x3_1" type: "ReLU" bottom: "inception_3b/double_3x3_1_bn" top: "inception_3b/double_3x3_1_bn" }
layer { name: "inception_3b/double_3x3_2" type: "Convolution" bottom: "inception_3b/double_3x3_1_bn" top: "inception_3b/double_3x3_2"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3b/double_3x3_2_bn" type: "BN" bottom: "inception_3b/double_3x3_2" top: "inception_3b/double_3x3_2_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3b/relu_double_3x3_2" type: "ReLU" bottom: "inception_3b/double_3x3_2_bn" top: "inception_3b/double_3x3_2_bn" }
layer { name: "inception_3b/pool" type: "Pooling" bottom: "inception_3a/output" top: "inception_3b/pool"
  pooling_param { pool: AVE kernel_size: 3 stride: 1 pad: 1 } }
layer { name: "inception_3b/pool_proj" type: "Convolution" bottom: "inception_3b/pool" top: "inception_3b/pool_proj"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3b/pool_proj_bn" type: "BN" bottom: "inception_3b/pool_proj" top: "inception_3b/pool_proj_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3b/relu_pool_proj" type: "ReLU" bottom: "inception_3b/pool_proj_bn" top: "inception_3b/pool_proj_bn" }
layer { name: "inception_3b/output" type: "Concat"
  bottom: "inception_3b/1x1_bn"
  bottom: "inception_3b/3x3_bn"
  bottom: "inception_3b/double_3x3_2_bn"
  bottom: "inception_3b/pool_proj_bn"
  top: "inception_3b/output" }

####################################### inception_3c #######################################
layer { name: "inception_3c/3x3_reduce" type: "Convolution" bottom: "inception_3b/output" top: "inception_3c/3x3_reduce"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 1
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3c/3x3_reduce_bn" type: "BN" bottom: "inception_3c/3x3_reduce" top: "inception_3c/3x3_reduce_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3c/relu_3x3_reduce" type: "ReLU" bottom: "inception_3c/3x3_reduce_bn" top: "inception_3c/3x3_reduce_bn" }
layer { name: "inception_3c/3x3" type: "Convolution" bottom: "inception_3c/3x3_reduce_bn" top: "inception_3c/3x3"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 160 pad: 1 kernel_size: 3 stride: 2
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3c/3x3_bn" type: "BN" bottom: "inception_3c/3x3" top: "inception_3c/3x3_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3c/relu_3x3" type: "ReLU" bottom: "inception_3c/3x3_bn" top: "inception_3c/3x3_bn" }
layer { name: "inception_3c/double_3x3_reduce" type: "Convolution" bottom: "inception_3b/output" top: "inception_3c/double_3x3_reduce"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 1
    weight_filler { type: "xavier" }
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3c/double_3x3_reduce_bn" type: "BN" bottom: "inception_3c/double_3x3_reduce" top: "inception_3c/double_3x3_reduce_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3c/relu_double_3x3_reduce" type: "ReLU" bottom: "inception_3c/double_3x3_reduce_bn" top: "inception_3c/double_3x3_reduce_bn" }
layer { name: "inception_3c/double_3x3_1" type: "Convolution" bottom: "inception_3c/double_3x3_reduce_bn" top: "inception_3c/double_3x3_1"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3c/double_3x3_1_bn" type: "BN" bottom: "inception_3c/double_3x3_1" top: "inception_3c/double_3x3_1_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3c/relu_double_3x3_1" type: "ReLU" bottom: "inception_3c/double_3x3_1_bn" top: "inception_3c/double_3x3_1_bn" }
layer { name: "inception_3c/double_3x3_2" type: "Convolution" bottom: "inception_3c/double_3x3_1_bn" top: "inception_3c/double_3x3_2"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param { num_output: 96 pad: 1 kernel_size: 3 stride: 2
    weight_filler { type: "xavier"}
    bias_filler { type: "constant" value: 0.2 } } }
layer { name: "inception_3c/double_3x3_2_bn" type: "BN" bottom: "inception_3c/double_3x3_2" top: "inception_3c/double_3x3_2_bn"
  param { lr_mult: 0.1 decay_mult: 1 } param { lr_mult: 0.2 decay_mult: 0 }
  bn_param { frozen: true slope_filler { type: "constant" value: 1 } bias_filler { type: "constant" value: 0 } } }
layer { name: "inception_3c/relu_double_3x3_2" type: "ReLU" bottom: "inception_3c/double_3x3_2_bn" top: "inception_3c/double_3x3_2_bn" }
layer { name: "inception_3c/pool" type: "Pooling" bottom: "inception_3b/output" top: "inception_3c/pool"
